DELL-G15/PSoC62S2_RT_EVB_Radar_CSK_Proximity/Radar_Presence_Application_RT/libs/TARGET_CYSBSYSKIT-DEV-01/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_PTRTUNERSENDCALLBACK_VALUE                                   (cy_capsense_tuner.commonContext.ptrTunerSendCallback)
#define CY_CAPSENSE_PTRTUNERSENDCALLBACK_OFFSET                                  (16u)
#define CY_CAPSENSE_PTRTUNERSENDCALLBACK_SIZE                                    (4u)
#define CY_CAPSENSE_PTRTUNERSENDCALLBACK_PARAM_ID                                (0x03000010u)

#define CY_CAPSENSE_PTRTUNERRECEIVECALLBACK_VALUE                                (cy_capsense_tuner.commonContext.ptrTunerReceiveCallback)
#define CY_CAPSENSE_PTRTUNERRECEIVECALLBACK_OFFSET                               (20u)
#define CY_CAPSENSE_PTRTUNERRECEIVECALLBACK_SIZE                                 (4u)
#define CY_CAPSENSE_PTRTUNERRECEIVECALLBACK_PARAM_ID                             (0x03000014u)

#define CY_CAPSENSE_STATUS_VALUE                                                 (cy_capsense_tuner.commonContext.status)
#define CY_CAPSENSE_STATUS_OFFSET                                                (24u)
#define CY_CAPSENSE_STATUS_SIZE                                                  (4u)
#define CY_CAPSENSE_STATUS_PARAM_ID                                              (0x03000018u)

#define CY_CAPSENSE_TIMESTAMPINTERVAL_VALUE                                      (cy_capsense_tuner.commonContext.timestampInterval)
#define CY_CAPSENSE_TIMESTAMPINTERVAL_OFFSET                                     (28u)
#define CY_CAPSENSE_TIMESTAMPINTERVAL_SIZE                                       (4u)
#define CY_CAPSENSE_TIMESTAMPINTERVAL_PARAM_ID                                   (0x0300001cu)

#define CY_CAPSENSE_TIMESTAMP_VALUE                                              (cy_capsense_tuner.commonContext.timestamp)
#define CY_CAPSENSE_TIMESTAMP_OFFSET                                             (32u)
#define CY_CAPSENSE_TIMESTAMP_SIZE                                               (4u)
#define CY_CAPSENSE_TIMESTAMP_PARAM_ID                                           (0x03000020u)

#define CY_CAPSENSE_CSD_MOD_CLK_DIVIDER_VALUE                                    (cy_capsense_tuner.commonContext.modCsdClk)
#define CY_CAPSENSE_CSD_MOD_CLK_DIVIDER_OFFSET                                   (36u)
#define CY_CAPSENSE_CSD_MOD_CLK_DIVIDER_SIZE                                     (1u)
#define CY_CAPSENSE_CSD_MOD_CLK_DIVIDER_PARAM_ID                                 (0x01000024u)

#define CY_CAPSENSE_CSX_MOD_CLK_DIVIDER_VALUE                                    (cy_capsense_tuner.commonContext.modCsxClk)
#define CY_CAPSENSE_CSX_MOD_CLK_DIVIDER_OFFSET                                   (37u)
#define CY_CAPSENSE_CSX_MOD_CLK_DIVIDER_SIZE                                     (1u)
#define CY_CAPSENSE_CSX_MOD_CLK_DIVIDER_PARAM_ID                                 (0x01000025u)

#define CY_CAPSENSE_TUNER_CNT_VALUE                                              (cy_capsense_tuner.commonContext.tunerCnt)
#define CY_CAPSENSE_TUNER_CNT_OFFSET                                             (38u)
#define CY_CAPSENSE_TUNER_CNT_SIZE                                               (1u)
#define CY_CAPSENSE_TUNER_CNT_PARAM_ID                                           (0x01000026u)

#define CY_CAPSENSE_PROXIMITY0_FINGER_CP_VALUE                                   (cy_capsense_tuner.widgetContext[0].fingerCap)
#define CY_CAPSENSE_PROXIMITY0_FINGER_CP_OFFSET                                  (40u)
#define CY_CAPSENSE_PROXIMITY0_FINGER_CP_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITY0_FINGER_CP_PARAM_ID                                (0x06000028u)

#define CY_CAPSENSE_PROXIMITY0_SIGPFC_VALUE                                      (cy_capsense_tuner.widgetContext[0].sigPFC)
#define CY_CAPSENSE_PROXIMITY0_SIGPFC_OFFSET                                     (42u)
#define CY_CAPSENSE_PROXIMITY0_SIGPFC_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITY0_SIGPFC_PARAM_ID                                   (0x0600002au)

#define CY_CAPSENSE_PROXIMITY0_RESOLUTION_VALUE                                  (cy_capsense_tuner.widgetContext[0].resolution)
#define CY_CAPSENSE_PROXIMITY0_RESOLUTION_OFFSET                                 (44u)
#define CY_CAPSENSE_PROXIMITY0_RESOLUTION_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITY0_RESOLUTION_PARAM_ID                               (0x0600002cu)

#define CY_CAPSENSE_PROXIMITY0_MAX_RAW_COUNT_VALUE                               (cy_capsense_tuner.widgetContext[0].maxRawCount)
#define CY_CAPSENSE_PROXIMITY0_MAX_RAW_COUNT_OFFSET                              (46u)
#define CY_CAPSENSE_PROXIMITY0_MAX_RAW_COUNT_SIZE                                (2u)
#define CY_CAPSENSE_PROXIMITY0_MAX_RAW_COUNT_PARAM_ID                            (0x0200002eu)

#define CY_CAPSENSE_PROXIMITY0_FINGER_TH_VALUE                                   (cy_capsense_tuner.widgetContext[0].fingerTh)
#define CY_CAPSENSE_PROXIMITY0_FINGER_TH_OFFSET                                  (48u)
#define CY_CAPSENSE_PROXIMITY0_FINGER_TH_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITY0_FINGER_TH_PARAM_ID                                (0x06000030u)

#define CY_CAPSENSE_PROXIMITY0_PROX_TOUCH_TH_VALUE                               (cy_capsense_tuner.widgetContext[0].proxTh)
#define CY_CAPSENSE_PROXIMITY0_PROX_TOUCH_TH_OFFSET                              (50u)
#define CY_CAPSENSE_PROXIMITY0_PROX_TOUCH_TH_SIZE                                (2u)
#define CY_CAPSENSE_PROXIMITY0_PROX_TOUCH_TH_PARAM_ID                            (0x06000032u)

#define CY_CAPSENSE_PROXIMITY0_LOW_BSLN_RST_VALUE                                (cy_capsense_tuner.widgetContext[0].lowBslnRst)
#define CY_CAPSENSE_PROXIMITY0_LOW_BSLN_RST_OFFSET                               (52u)
#define CY_CAPSENSE_PROXIMITY0_LOW_BSLN_RST_SIZE                                 (2u)
#define CY_CAPSENSE_PROXIMITY0_LOW_BSLN_RST_PARAM_ID                             (0x06000034u)

#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_VALUE                                     (cy_capsense_tuner.widgetContext[0].snsClk)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_OFFSET                                    (54u)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_SIZE                                      (2u)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_PARAM_ID                                  (0x06000036u)

#define CY_CAPSENSE_PROXIMITY0_ROW_SNS_CLK_VALUE                                 (cy_capsense_tuner.widgetContext[0].rowSnsClk)
#define CY_CAPSENSE_PROXIMITY0_ROW_SNS_CLK_OFFSET                                (56u)
#define CY_CAPSENSE_PROXIMITY0_ROW_SNS_CLK_SIZE                                  (2u)
#define CY_CAPSENSE_PROXIMITY0_ROW_SNS_CLK_PARAM_ID                              (0x06000038u)

#define CY_CAPSENSE_PROXIMITY0_GESTURE_DETECTED_VALUE                            (cy_capsense_tuner.widgetContext[0].gestureDetected)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DETECTED_OFFSET                           (58u)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DETECTED_SIZE                             (2u)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DETECTED_PARAM_ID                         (0x0200003au)

