DELL-G15/PSoC62S2_RT_EVB_Radar_CSK_Proximity/Radar_Presence_Application_RT/libs/TARGET_CYSBSYSKIT-DEV-01/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DIRECTION_VALUE                           (cy_capsense_tuner.widgetContext[0].gestureDirection)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DIRECTION_OFFSET                          (60u)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DIRECTION_SIZE                            (2u)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DIRECTION_PARAM_ID                        (0x0200003cu)

#define CY_CAPSENSE_PROXIMITY0_XDELTA_VALUE                                      (cy_capsense_tuner.widgetContext[0].xDelta)
#define CY_CAPSENSE_PROXIMITY0_XDELTA_OFFSET                                     (62u)
#define CY_CAPSENSE_PROXIMITY0_XDELTA_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITY0_XDELTA_PARAM_ID                                   (0x0200003eu)

#define CY_CAPSENSE_PROXIMITY0_YDELTA_VALUE                                      (cy_capsense_tuner.widgetContext[0].yDelta)
#define CY_CAPSENSE_PROXIMITY0_YDELTA_OFFSET                                     (64u)
#define CY_CAPSENSE_PROXIMITY0_YDELTA_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITY0_YDELTA_PARAM_ID                                   (0x02000040u)

#define CY_CAPSENSE_PROXIMITY0_NOISE_TH_VALUE                                    (cy_capsense_tuner.widgetContext[0].noiseTh)
#define CY_CAPSENSE_PROXIMITY0_NOISE_TH_OFFSET                                   (66u)
#define CY_CAPSENSE_PROXIMITY0_NOISE_TH_SIZE                                     (1u)
#define CY_CAPSENSE_PROXIMITY0_NOISE_TH_PARAM_ID                                 (0x05000042u)

#define CY_CAPSENSE_PROXIMITY0_NNOISE_TH_VALUE                                   (cy_capsense_tuner.widgetContext[0].nNoiseTh)
#define CY_CAPSENSE_PROXIMITY0_NNOISE_TH_OFFSET                                  (67u)
#define CY_CAPSENSE_PROXIMITY0_NNOISE_TH_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITY0_NNOISE_TH_PARAM_ID                                (0x05000043u)

#define CY_CAPSENSE_PROXIMITY0_HYSTERESIS_VALUE                                  (cy_capsense_tuner.widgetContext[0].hysteresis)
#define CY_CAPSENSE_PROXIMITY0_HYSTERESIS_OFFSET                                 (68u)
#define CY_CAPSENSE_PROXIMITY0_HYSTERESIS_SIZE                                   (1u)
#define CY_CAPSENSE_PROXIMITY0_HYSTERESIS_PARAM_ID                               (0x05000044u)

#define CY_CAPSENSE_PROXIMITY0_ON_DEBOUNCE_VALUE                                 (cy_capsense_tuner.widgetContext[0].onDebounce)
#define CY_CAPSENSE_PROXIMITY0_ON_DEBOUNCE_OFFSET                                (69u)
#define CY_CAPSENSE_PROXIMITY0_ON_DEBOUNCE_SIZE                                  (1u)
#define CY_CAPSENSE_PROXIMITY0_ON_DEBOUNCE_PARAM_ID                              (0x05000045u)

#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_SOURCE_VALUE                              (cy_capsense_tuner.widgetContext[0].snsClkSource)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_SOURCE_OFFSET                             (70u)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_SOURCE_SIZE                               (1u)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_SOURCE_PARAM_ID                           (0x05000046u)

#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD0_VALUE                                   (cy_capsense_tuner.widgetContext[0].idacMod[0])
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD0_OFFSET                                  (71u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD0_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD0_PARAM_ID                                (0x05000047u)

#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD1_VALUE                                   (cy_capsense_tuner.widgetContext[0].idacMod[1])
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD1_OFFSET                                  (72u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD1_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD1_PARAM_ID                                (0x05000048u)

#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD2_VALUE                                   (cy_capsense_tuner.widgetContext[0].idacMod[2])
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD2_OFFSET                                  (73u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD2_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD2_PARAM_ID                                (0x05000049u)

#define CY_CAPSENSE_PROXIMITY0_IDAC_GAIN_INDEX_VALUE                             (cy_capsense_tuner.widgetContext[0].idacGainIndex)
#define CY_CAPSENSE_PROXIMITY0_IDAC_GAIN_INDEX_OFFSET                            (74u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_GAIN_INDEX_SIZE                              (1u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_GAIN_INDEX_PARAM_ID                          (0x0500004au)

#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD0_VALUE                               (cy_capsense_tuner.widgetContext[0].rowIdacMod[0])
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD0_OFFSET                              (75u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD0_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD0_PARAM_ID                            (0x0500004bu)

#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD1_VALUE                               (cy_capsense_tuner.widgetContext[0].rowIdacMod[1])
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD1_OFFSET                              (76u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD1_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD1_PARAM_ID                            (0x0500004cu)

#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD2_VALUE                               (cy_capsense_tuner.widgetContext[0].rowIdacMod[2])
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD2_OFFSET                              (77u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD2_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD2_PARAM_ID                            (0x0500004du)

#define CY_CAPSENSE_PROXIMITY0_PROX_IIR_BL_N_VALUE                               (cy_capsense_tuner.widgetContext[0].bslnCoeff)
#define CY_CAPSENSE_PROXIMITY0_PROX_IIR_BL_N_OFFSET                              (78u)
#define CY_CAPSENSE_PROXIMITY0_PROX_IIR_BL_N_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITY0_PROX_IIR_BL_N_PARAM_ID                            (0x0100004eu)

#define CY_CAPSENSE_PROXIMITY0_STATUS_VALUE                                      (cy_capsense_tuner.widgetContext[0].status)
#define CY_CAPSENSE_PROXIMITY0_STATUS_OFFSET                                     (79u)
#define CY_CAPSENSE_PROXIMITY0_STATUS_SIZE                                       (1u)
#define CY_CAPSENSE_PROXIMITY0_STATUS_PARAM_ID                                   (0x0100004fu)

#define CY_CAPSENSE_PROXIMITY0_PTRPOSITION_VALUE                                 (cy_capsense_tuner.widgetContext[0].wdTouch.ptrPosition)
#define CY_CAPSENSE_PROXIMITY0_PTRPOSITION_OFFSET                                (80u)
#define CY_CAPSENSE_PROXIMITY0_PTRPOSITION_SIZE                                  (4u)
#define CY_CAPSENSE_PROXIMITY0_PTRPOSITION_PARAM_ID                              (0x03000050u)

#define CY_CAPSENSE_PROXIMITY0_NUM_POSITIONS_VALUE                               (cy_capsense_tuner.widgetContext[0].wdTouch.numPosition)
#define CY_CAPSENSE_PROXIMITY0_NUM_POSITIONS_OFFSET                              (84u)
#define CY_CAPSENSE_PROXIMITY0_NUM_POSITIONS_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITY0_NUM_POSITIONS_PARAM_ID                            (0x01000054u)

#define CY_CAPSENSE_PROXIMITYW_FINGER_CP_VALUE                                   (cy_capsense_tuner.widgetContext[1].fingerCap)
#define CY_CAPSENSE_PROXIMITYW_FINGER_CP_OFFSET                                  (88u)
#define CY_CAPSENSE_PROXIMITYW_FINGER_CP_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITYW_FINGER_CP_PARAM_ID                                (0x06010058u)

