DELL-G15/PSoC62S2_RT_EVB_Radar_CSK_Proximity/Radar_Presence_Application_RT/libs/TARGET_CYSBSYSKIT-DEV-01/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_PROXIMITYW_SIGPFC_VALUE                                      (cy_capsense_tuner.widgetContext[1].sigPFC)
#define CY_CAPSENSE_PROXIMITYW_SIGPFC_OFFSET                                     (90u)
#define CY_CAPSENSE_PROXIMITYW_SIGPFC_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITYW_SIGPFC_PARAM_ID                                   (0x0601005au)

#define CY_CAPSENSE_PROXIMITYW_RESOLUTION_VALUE                                  (cy_capsense_tuner.widgetContext[1].resolution)
#define CY_CAPSENSE_PROXIMITYW_RESOLUTION_OFFSET                                 (92u)
#define CY_CAPSENSE_PROXIMITYW_RESOLUTION_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITYW_RESOLUTION_PARAM_ID                               (0x0601005cu)

#define CY_CAPSENSE_PROXIMITYW_MAX_RAW_COUNT_VALUE                               (cy_capsense_tuner.widgetContext[1].maxRawCount)
#define CY_CAPSENSE_PROXIMITYW_MAX_RAW_COUNT_OFFSET                              (94u)
#define CY_CAPSENSE_PROXIMITYW_MAX_RAW_COUNT_SIZE                                (2u)
#define CY_CAPSENSE_PROXIMITYW_MAX_RAW_COUNT_PARAM_ID                            (0x0201005eu)

#define CY_CAPSENSE_PROXIMITYW_FINGER_TH_VALUE                                   (cy_capsense_tuner.widgetContext[1].fingerTh)
#define CY_CAPSENSE_PROXIMITYW_FINGER_TH_OFFSET                                  (96u)
#define CY_CAPSENSE_PROXIMITYW_FINGER_TH_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITYW_FINGER_TH_PARAM_ID                                (0x06010060u)

#define CY_CAPSENSE_PROXIMITYW_PROX_TOUCH_TH_VALUE                               (cy_capsense_tuner.widgetContext[1].proxTh)
#define CY_CAPSENSE_PROXIMITYW_PROX_TOUCH_TH_OFFSET                              (98u)
#define CY_CAPSENSE_PROXIMITYW_PROX_TOUCH_TH_SIZE                                (2u)
#define CY_CAPSENSE_PROXIMITYW_PROX_TOUCH_TH_PARAM_ID                            (0x06010062u)

#define CY_CAPSENSE_PROXIMITYW_LOW_BSLN_RST_VALUE                                (cy_capsense_tuner.widgetContext[1].lowBslnRst)
#define CY_CAPSENSE_PROXIMITYW_LOW_BSLN_RST_OFFSET                               (100u)
#define CY_CAPSENSE_PROXIMITYW_LOW_BSLN_RST_SIZE                                 (2u)
#define CY_CAPSENSE_PROXIMITYW_LOW_BSLN_RST_PARAM_ID                             (0x06010064u)

#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_VALUE                                     (cy_capsense_tuner.widgetContext[1].snsClk)
#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_OFFSET                                    (102u)
#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_SIZE                                      (2u)
#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_PARAM_ID                                  (0x06010066u)

#define CY_CAPSENSE_PROXIMITYW_ROW_SNS_CLK_VALUE                                 (cy_capsense_tuner.widgetContext[1].rowSnsClk)
#define CY_CAPSENSE_PROXIMITYW_ROW_SNS_CLK_OFFSET                                (104u)
#define CY_CAPSENSE_PROXIMITYW_ROW_SNS_CLK_SIZE                                  (2u)
#define CY_CAPSENSE_PROXIMITYW_ROW_SNS_CLK_PARAM_ID                              (0x06010068u)

#define CY_CAPSENSE_PROXIMITYW_GESTURE_DETECTED_VALUE                            (cy_capsense_tuner.widgetContext[1].gestureDetected)
#define CY_CAPSENSE_PROXIMITYW_GESTURE_DETECTED_OFFSET                           (106u)
#define CY_CAPSENSE_PROXIMITYW_GESTURE_DETECTED_SIZE                             (2u)
#define CY_CAPSENSE_PROXIMITYW_GESTURE_DETECTED_PARAM_ID                         (0x0201006au)

#define CY_CAPSENSE_PROXIMITYW_GESTURE_DIRECTION_VALUE                           (cy_capsense_tuner.widgetContext[1].gestureDirection)
#define CY_CAPSENSE_PROXIMITYW_GESTURE_DIRECTION_OFFSET                          (108u)
#define CY_CAPSENSE_PROXIMITYW_GESTURE_DIRECTION_SIZE                            (2u)
#define CY_CAPSENSE_PROXIMITYW_GESTURE_DIRECTION_PARAM_ID                        (0x0201006cu)

#define CY_CAPSENSE_PROXIMITYW_XDELTA_VALUE                                      (cy_capsense_tuner.widgetContext[1].xDelta)
#define CY_CAPSENSE_PROXIMITYW_XDELTA_OFFSET                                     (110u)
#define CY_CAPSENSE_PROXIMITYW_XDELTA_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITYW_XDELTA_PARAM_ID                                   (0x0201006eu)

#define CY_CAPSENSE_PROXIMITYW_YDELTA_VALUE                                      (cy_capsense_tuner.widgetContext[1].yDelta)
#define CY_CAPSENSE_PROXIMITYW_YDELTA_OFFSET                                     (112u)
#define CY_CAPSENSE_PROXIMITYW_YDELTA_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITYW_YDELTA_PARAM_ID                                   (0x02010070u)

#define CY_CAPSENSE_PROXIMITYW_NOISE_TH_VALUE                                    (cy_capsense_tuner.widgetContext[1].noiseTh)
#define CY_CAPSENSE_PROXIMITYW_NOISE_TH_OFFSET                                   (114u)
#define CY_CAPSENSE_PROXIMITYW_NOISE_TH_SIZE                                     (1u)
#define CY_CAPSENSE_PROXIMITYW_NOISE_TH_PARAM_ID                                 (0x05010072u)

#define CY_CAPSENSE_PROXIMITYW_NNOISE_TH_VALUE                                   (cy_capsense_tuner.widgetContext[1].nNoiseTh)
#define CY_CAPSENSE_PROXIMITYW_NNOISE_TH_OFFSET                                  (115u)
#define CY_CAPSENSE_PROXIMITYW_NNOISE_TH_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITYW_NNOISE_TH_PARAM_ID                                (0x05010073u)

#define CY_CAPSENSE_PROXIMITYW_HYSTERESIS_VALUE                                  (cy_capsense_tuner.widgetContext[1].hysteresis)
#define CY_CAPSENSE_PROXIMITYW_HYSTERESIS_OFFSET                                 (116u)
#define CY_CAPSENSE_PROXIMITYW_HYSTERESIS_SIZE                                   (1u)
#define CY_CAPSENSE_PROXIMITYW_HYSTERESIS_PARAM_ID                               (0x05010074u)

#define CY_CAPSENSE_PROXIMITYW_ON_DEBOUNCE_VALUE                                 (cy_capsense_tuner.widgetContext[1].onDebounce)
#define CY_CAPSENSE_PROXIMITYW_ON_DEBOUNCE_OFFSET                                (117u)
#define CY_CAPSENSE_PROXIMITYW_ON_DEBOUNCE_SIZE                                  (1u)
#define CY_CAPSENSE_PROXIMITYW_ON_DEBOUNCE_PARAM_ID                              (0x05010075u)

