DELL-G15/PSoC62S2_RT_EVB_Radar_CSK_Proximity/Radar_Presence_Application_RT/libs/TARGET_CYSBSYSKIT-DEV-01/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_SOURCE_VALUE                              (cy_capsense_tuner.widgetContext[1].snsClkSource)
#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_SOURCE_OFFSET                             (118u)
#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_SOURCE_SIZE                               (1u)
#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_SOURCE_PARAM_ID                           (0x05010076u)

#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD0_VALUE                                   (cy_capsense_tuner.widgetContext[1].idacMod[0])
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD0_OFFSET                                  (119u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD0_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD0_PARAM_ID                                (0x05010077u)

#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD1_VALUE                                   (cy_capsense_tuner.widgetContext[1].idacMod[1])
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD1_OFFSET                                  (120u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD1_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD1_PARAM_ID                                (0x05010078u)

#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD2_VALUE                                   (cy_capsense_tuner.widgetContext[1].idacMod[2])
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD2_OFFSET                                  (121u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD2_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD2_PARAM_ID                                (0x05010079u)

#define CY_CAPSENSE_PROXIMITYW_IDAC_GAIN_INDEX_VALUE                             (cy_capsense_tuner.widgetContext[1].idacGainIndex)
#define CY_CAPSENSE_PROXIMITYW_IDAC_GAIN_INDEX_OFFSET                            (122u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_GAIN_INDEX_SIZE                              (1u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_GAIN_INDEX_PARAM_ID                          (0x0501007au)

#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD0_VALUE                               (cy_capsense_tuner.widgetContext[1].rowIdacMod[0])
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD0_OFFSET                              (123u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD0_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD0_PARAM_ID                            (0x0501007bu)

#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD1_VALUE                               (cy_capsense_tuner.widgetContext[1].rowIdacMod[1])
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD1_OFFSET                              (124u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD1_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD1_PARAM_ID                            (0x0501007cu)

#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD2_VALUE                               (cy_capsense_tuner.widgetContext[1].rowIdacMod[2])
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD2_OFFSET                              (125u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD2_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD2_PARAM_ID                            (0x0501007du)

#define CY_CAPSENSE_PROXIMITYW_PROX_IIR_BL_N_VALUE                               (cy_capsense_tuner.widgetContext[1].bslnCoeff)
#define CY_CAPSENSE_PROXIMITYW_PROX_IIR_BL_N_OFFSET                              (126u)
#define CY_CAPSENSE_PROXIMITYW_PROX_IIR_BL_N_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITYW_PROX_IIR_BL_N_PARAM_ID                            (0x0101007eu)

#define CY_CAPSENSE_PROXIMITYW_STATUS_VALUE                                      (cy_capsense_tuner.widgetContext[1].status)
#define CY_CAPSENSE_PROXIMITYW_STATUS_OFFSET                                     (127u)
#define CY_CAPSENSE_PROXIMITYW_STATUS_SIZE                                       (1u)
#define CY_CAPSENSE_PROXIMITYW_STATUS_PARAM_ID                                   (0x0101007fu)

#define CY_CAPSENSE_PROXIMITYW_PTRPOSITION_VALUE                                 (cy_capsense_tuner.widgetContext[1].wdTouch.ptrPosition)
#define CY_CAPSENSE_PROXIMITYW_PTRPOSITION_OFFSET                                (128u)
#define CY_CAPSENSE_PROXIMITYW_PTRPOSITION_SIZE                                  (4u)
#define CY_CAPSENSE_PROXIMITYW_PTRPOSITION_PARAM_ID                              (0x03010080u)

#define CY_CAPSENSE_PROXIMITYW_NUM_POSITIONS_VALUE                               (cy_capsense_tuner.widgetContext[1].wdTouch.numPosition)
#define CY_CAPSENSE_PROXIMITYW_NUM_POSITIONS_OFFSET                              (132u)
#define CY_CAPSENSE_PROXIMITYW_NUM_POSITIONS_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITYW_NUM_POSITIONS_PARAM_ID                            (0x01010084u)

#define CY_CAPSENSE_PROXIMITY0_SNS0_RAW0_VALUE                                   (cy_capsense_tuner.sensorContext[0].raw)
#define CY_CAPSENSE_PROXIMITY0_SNS0_RAW0_OFFSET                                  (136u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_RAW0_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_RAW0_PARAM_ID                                (0x02000088u)

#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN0_VALUE                                  (cy_capsense_tuner.sensorContext[0].bsln)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN0_OFFSET                                 (138u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN0_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN0_PARAM_ID                               (0x0200008au)

#define CY_CAPSENSE_PROXIMITY0_SNS0_DIFF0_VALUE                                  (cy_capsense_tuner.sensorContext[0].diff)
#define CY_CAPSENSE_PROXIMITY0_SNS0_DIFF0_OFFSET                                 (140u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_DIFF0_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_DIFF0_PARAM_ID                               (0x0200008cu)

#define CY_CAPSENSE_PROXIMITY0_SNS0_STATUS0_VALUE                                (cy_capsense_tuner.sensorContext[0].status)
#define CY_CAPSENSE_PROXIMITY0_SNS0_STATUS0_OFFSET                               (142u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_STATUS0_SIZE                                 (1u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_STATUS0_PARAM_ID                             (0x0100008eu)

#define CY_CAPSENSE_PROXIMITY0_SNS0_NEG_BSLN_RST_CNT0_VALUE                      (cy_capsense_tuner.sensorContext[0].negBslnRstCnt)
#define CY_CAPSENSE_PROXIMITY0_SNS0_NEG_BSLN_RST_CNT0_OFFSET                     (143u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_NEG_BSLN_RST_CNT0_SIZE                       (1u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_NEG_BSLN_RST_CNT0_PARAM_ID                   (0x0100008fu)

#define CY_CAPSENSE_PROXIMITY0_SNS0_IDAC0_VALUE                                  (cy_capsense_tuner.sensorContext[0].idacComp)
#define CY_CAPSENSE_PROXIMITY0_SNS0_IDAC0_OFFSET                                 (144u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_IDAC0_SIZE                                   (1u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_IDAC0_PARAM_ID                               (0x01000090u)

#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN_EXT0_VALUE                              (cy_capsense_tuner.sensorContext[0].bslnExt)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN_EXT0_OFFSET                             (145u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN_EXT0_SIZE                               (1u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN_EXT0_PARAM_ID                           (0x01000091u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_RAW0_VALUE                                   (cy_capsense_tuner.sensorContext[1].raw)
#define CY_CAPSENSE_PROXIMITYW_SNS0_RAW0_OFFSET                                  (146u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_RAW0_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_RAW0_PARAM_ID                                (0x02010092u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN0_VALUE                                  (cy_capsense_tuner.sensorContext[1].bsln)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN0_OFFSET                                 (148u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN0_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN0_PARAM_ID                               (0x02010094u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_DIFF0_VALUE                                  (cy_capsense_tuner.sensorContext[1].diff)
#define CY_CAPSENSE_PROXIMITYW_SNS0_DIFF0_OFFSET                                 (150u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_DIFF0_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_DIFF0_PARAM_ID                               (0x02010096u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_STATUS0_VALUE                                (cy_capsense_tuner.sensorContext[1].status)
#define CY_CAPSENSE_PROXIMITYW_SNS0_STATUS0_OFFSET                               (152u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_STATUS0_SIZE                                 (1u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_STATUS0_PARAM_ID                             (0x01010098u)

