DELL-G15/PSoC62S2_RT_EVB_Radar_CSK_Proximity/Radar_Presence_Application_RT/libs/TARGET_CYSBSYSKIT-DEV-01/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_PROXIMITYW_SNS0_NEG_BSLN_RST_CNT0_VALUE                      (cy_capsense_tuner.sensorContext[1].negBslnRstCnt)
#define CY_CAPSENSE_PROXIMITYW_SNS0_NEG_BSLN_RST_CNT0_OFFSET                     (153u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_NEG_BSLN_RST_CNT0_SIZE                       (1u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_NEG_BSLN_RST_CNT0_PARAM_ID                   (0x01010099u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_IDAC0_VALUE                                  (cy_capsense_tuner.sensorContext[1].idacComp)
#define CY_CAPSENSE_PROXIMITYW_SNS0_IDAC0_OFFSET                                 (154u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_IDAC0_SIZE                                   (1u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_IDAC0_PARAM_ID                               (0x0101009au)

#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN_EXT0_VALUE                              (cy_capsense_tuner.sensorContext[1].bslnExt)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN_EXT0_OFFSET                             (155u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN_EXT0_SIZE                               (1u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN_EXT0_PARAM_ID                           (0x0101009bu)

#else /* CY_CAPSENSE_MW_VERSION >= 300 */
#define CY_CAPSENSE_CONFIG_ID_VALUE                                              (cy_capsense_tuner.commonContext.configId)
#define CY_CAPSENSE_CONFIG_ID_OFFSET                                             (0u)
#define CY_CAPSENSE_CONFIG_ID_SIZE                                               (2u)
#define CY_CAPSENSE_CONFIG_ID_PARAM_ID                                           (0x02000000u)

#define CY_CAPSENSE_TUNER_CMD_VALUE                                              (cy_capsense_tuner.commonContext.tunerCmd)
#define CY_CAPSENSE_TUNER_CMD_OFFSET                                             (2u)
#define CY_CAPSENSE_TUNER_CMD_SIZE                                               (2u)
#define CY_CAPSENSE_TUNER_CMD_PARAM_ID                                           (0x02000002u)

#define CY_CAPSENSE_SCAN_COUNTER_VALUE                                           (cy_capsense_tuner.commonContext.scanCounter)
#define CY_CAPSENSE_SCAN_COUNTER_OFFSET                                          (4u)
#define CY_CAPSENSE_SCAN_COUNTER_SIZE                                            (2u)
#define CY_CAPSENSE_SCAN_COUNTER_PARAM_ID                                        (0x02000004u)

#define CY_CAPSENSE_TUNER_ST_VALUE                                               (cy_capsense_tuner.commonContext.tunerSt)
#define CY_CAPSENSE_TUNER_ST_OFFSET                                              (6u)
#define CY_CAPSENSE_TUNER_ST_SIZE                                                (1u)
#define CY_CAPSENSE_TUNER_ST_PARAM_ID                                            (0x01000006u)

#define CY_CAPSENSE_INITDONE_VALUE                                               (cy_capsense_tuner.commonContext.initDone)
#define CY_CAPSENSE_INITDONE_OFFSET                                              (7u)
#define CY_CAPSENSE_INITDONE_SIZE                                                (1u)
#define CY_CAPSENSE_INITDONE_PARAM_ID                                            (0x01000007u)

#define CY_CAPSENSE_STATUS_VALUE                                                 (cy_capsense_tuner.commonContext.status)
#define CY_CAPSENSE_STATUS_OFFSET                                                (8u)
#define CY_CAPSENSE_STATUS_SIZE                                                  (4u)
#define CY_CAPSENSE_STATUS_PARAM_ID                                              (0x03000008u)

#define CY_CAPSENSE_TIMESTAMPINTERVAL_VALUE                                      (cy_capsense_tuner.commonContext.timestampInterval)
#define CY_CAPSENSE_TIMESTAMPINTERVAL_OFFSET                                     (12u)
#define CY_CAPSENSE_TIMESTAMPINTERVAL_SIZE                                       (4u)
#define CY_CAPSENSE_TIMESTAMPINTERVAL_PARAM_ID                                   (0x0300000cu)

#define CY_CAPSENSE_TIMESTAMP_VALUE                                              (cy_capsense_tuner.commonContext.timestamp)
#define CY_CAPSENSE_TIMESTAMP_OFFSET                                             (16u)
#define CY_CAPSENSE_TIMESTAMP_SIZE                                               (4u)
#define CY_CAPSENSE_TIMESTAMP_PARAM_ID                                           (0x03000010u)

#define CY_CAPSENSE_CSD_MOD_CLK_DIVIDER_VALUE                                    (cy_capsense_tuner.commonContext.modCsdClk)
#define CY_CAPSENSE_CSD_MOD_CLK_DIVIDER_OFFSET                                   (20u)
#define CY_CAPSENSE_CSD_MOD_CLK_DIVIDER_SIZE                                     (1u)
#define CY_CAPSENSE_CSD_MOD_CLK_DIVIDER_PARAM_ID                                 (0x01000014u)

#define CY_CAPSENSE_CSX_MOD_CLK_DIVIDER_VALUE                                    (cy_capsense_tuner.commonContext.modCsxClk)
#define CY_CAPSENSE_CSX_MOD_CLK_DIVIDER_OFFSET                                   (21u)
#define CY_CAPSENSE_CSX_MOD_CLK_DIVIDER_SIZE                                     (1u)
#define CY_CAPSENSE_CSX_MOD_CLK_DIVIDER_PARAM_ID                                 (0x01000015u)

#define CY_CAPSENSE_TUNER_CNT_VALUE                                              (cy_capsense_tuner.commonContext.tunerCnt)
#define CY_CAPSENSE_TUNER_CNT_OFFSET                                             (22u)
#define CY_CAPSENSE_TUNER_CNT_SIZE                                               (1u)
#define CY_CAPSENSE_TUNER_CNT_PARAM_ID                                           (0x01000016u)

#define CY_CAPSENSE_PROXIMITY0_FINGER_CP_VALUE                                   (cy_capsense_tuner.widgetContext[0].fingerCap)
#define CY_CAPSENSE_PROXIMITY0_FINGER_CP_OFFSET                                  (24u)
#define CY_CAPSENSE_PROXIMITY0_FINGER_CP_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITY0_FINGER_CP_PARAM_ID                                (0x06000018u)

#define CY_CAPSENSE_PROXIMITY0_SIGPFC_VALUE                                      (cy_capsense_tuner.widgetContext[0].sigPFC)
#define CY_CAPSENSE_PROXIMITY0_SIGPFC_OFFSET                                     (26u)
#define CY_CAPSENSE_PROXIMITY0_SIGPFC_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITY0_SIGPFC_PARAM_ID                                   (0x0600001au)

#define CY_CAPSENSE_PROXIMITY0_RESOLUTION_VALUE                                  (cy_capsense_tuner.widgetContext[0].resolution)
#define CY_CAPSENSE_PROXIMITY0_RESOLUTION_OFFSET                                 (28u)
#define CY_CAPSENSE_PROXIMITY0_RESOLUTION_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITY0_RESOLUTION_PARAM_ID                               (0x0600001cu)

#define CY_CAPSENSE_PROXIMITY0_MAX_RAW_COUNT_VALUE                               (cy_capsense_tuner.widgetContext[0].maxRawCount)
#define CY_CAPSENSE_PROXIMITY0_MAX_RAW_COUNT_OFFSET                              (30u)
#define CY_CAPSENSE_PROXIMITY0_MAX_RAW_COUNT_SIZE                                (2u)
#define CY_CAPSENSE_PROXIMITY0_MAX_RAW_COUNT_PARAM_ID                            (0x0200001eu)

