DELL-G15/PSoC62S2_RT_EVB_Radar_CSK_Proximity/Radar_Presence_Application_RT/libs/TARGET_CYSBSYSKIT-DEV-01/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_PROXIMITY0_ROW_MAX_RAW_COUNT_VALUE                           (cy_capsense_tuner.widgetContext[0].maxRawCountRow)
#define CY_CAPSENSE_PROXIMITY0_ROW_MAX_RAW_COUNT_OFFSET                          (32u)
#define CY_CAPSENSE_PROXIMITY0_ROW_MAX_RAW_COUNT_SIZE                            (2u)
#define CY_CAPSENSE_PROXIMITY0_ROW_MAX_RAW_COUNT_PARAM_ID                        (0x02000020u)

#define CY_CAPSENSE_PROXIMITY0_FINGER_TH_VALUE                                   (cy_capsense_tuner.widgetContext[0].fingerTh)
#define CY_CAPSENSE_PROXIMITY0_FINGER_TH_OFFSET                                  (34u)
#define CY_CAPSENSE_PROXIMITY0_FINGER_TH_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITY0_FINGER_TH_PARAM_ID                                (0x06000022u)

#define CY_CAPSENSE_PROXIMITY0_PROX_TOUCH_TH_VALUE                               (cy_capsense_tuner.widgetContext[0].proxTh)
#define CY_CAPSENSE_PROXIMITY0_PROX_TOUCH_TH_OFFSET                              (36u)
#define CY_CAPSENSE_PROXIMITY0_PROX_TOUCH_TH_SIZE                                (2u)
#define CY_CAPSENSE_PROXIMITY0_PROX_TOUCH_TH_PARAM_ID                            (0x06000024u)

#define CY_CAPSENSE_PROXIMITY0_LOW_BSLN_RST_VALUE                                (cy_capsense_tuner.widgetContext[0].lowBslnRst)
#define CY_CAPSENSE_PROXIMITY0_LOW_BSLN_RST_OFFSET                               (38u)
#define CY_CAPSENSE_PROXIMITY0_LOW_BSLN_RST_SIZE                                 (2u)
#define CY_CAPSENSE_PROXIMITY0_LOW_BSLN_RST_PARAM_ID                             (0x06000026u)

#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_VALUE                                     (cy_capsense_tuner.widgetContext[0].snsClk)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_OFFSET                                    (40u)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_SIZE                                      (2u)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_PARAM_ID                                  (0x06000028u)

#define CY_CAPSENSE_PROXIMITY0_ROW_SNS_CLK_VALUE                                 (cy_capsense_tuner.widgetContext[0].rowSnsClk)
#define CY_CAPSENSE_PROXIMITY0_ROW_SNS_CLK_OFFSET                                (42u)
#define CY_CAPSENSE_PROXIMITY0_ROW_SNS_CLK_SIZE                                  (2u)
#define CY_CAPSENSE_PROXIMITY0_ROW_SNS_CLK_PARAM_ID                              (0x0600002au)

#define CY_CAPSENSE_PROXIMITY0_GESTURE_DETECTED_VALUE                            (cy_capsense_tuner.widgetContext[0].gestureDetected)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DETECTED_OFFSET                           (44u)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DETECTED_SIZE                             (2u)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DETECTED_PARAM_ID                         (0x0200002cu)

#define CY_CAPSENSE_PROXIMITY0_GESTURE_DIRECTION_VALUE                           (cy_capsense_tuner.widgetContext[0].gestureDirection)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DIRECTION_OFFSET                          (46u)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DIRECTION_SIZE                            (2u)
#define CY_CAPSENSE_PROXIMITY0_GESTURE_DIRECTION_PARAM_ID                        (0x0200002eu)

#define CY_CAPSENSE_PROXIMITY0_XDELTA_VALUE                                      (cy_capsense_tuner.widgetContext[0].xDelta)
#define CY_CAPSENSE_PROXIMITY0_XDELTA_OFFSET                                     (48u)
#define CY_CAPSENSE_PROXIMITY0_XDELTA_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITY0_XDELTA_PARAM_ID                                   (0x02000030u)

#define CY_CAPSENSE_PROXIMITY0_YDELTA_VALUE                                      (cy_capsense_tuner.widgetContext[0].yDelta)
#define CY_CAPSENSE_PROXIMITY0_YDELTA_OFFSET                                     (50u)
#define CY_CAPSENSE_PROXIMITY0_YDELTA_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITY0_YDELTA_PARAM_ID                                   (0x02000032u)

#define CY_CAPSENSE_PROXIMITY0_NOISE_TH_VALUE                                    (cy_capsense_tuner.widgetContext[0].noiseTh)
#define CY_CAPSENSE_PROXIMITY0_NOISE_TH_OFFSET                                   (52u)
#define CY_CAPSENSE_PROXIMITY0_NOISE_TH_SIZE                                     (2u)
#define CY_CAPSENSE_PROXIMITY0_NOISE_TH_PARAM_ID                                 (0x06000034u)

#define CY_CAPSENSE_PROXIMITY0_NNOISE_TH_VALUE                                   (cy_capsense_tuner.widgetContext[0].nNoiseTh)
#define CY_CAPSENSE_PROXIMITY0_NNOISE_TH_OFFSET                                  (54u)
#define CY_CAPSENSE_PROXIMITY0_NNOISE_TH_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITY0_NNOISE_TH_PARAM_ID                                (0x06000036u)

#define CY_CAPSENSE_PROXIMITY0_HYSTERESIS_VALUE                                  (cy_capsense_tuner.widgetContext[0].hysteresis)
#define CY_CAPSENSE_PROXIMITY0_HYSTERESIS_OFFSET                                 (56u)
#define CY_CAPSENSE_PROXIMITY0_HYSTERESIS_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITY0_HYSTERESIS_PARAM_ID                               (0x06000038u)

#define CY_CAPSENSE_PROXIMITY0_ON_DEBOUNCE_VALUE                                 (cy_capsense_tuner.widgetContext[0].onDebounce)
#define CY_CAPSENSE_PROXIMITY0_ON_DEBOUNCE_OFFSET                                (58u)
#define CY_CAPSENSE_PROXIMITY0_ON_DEBOUNCE_SIZE                                  (1u)
#define CY_CAPSENSE_PROXIMITY0_ON_DEBOUNCE_PARAM_ID                              (0x0500003au)

#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_SOURCE_VALUE                              (cy_capsense_tuner.widgetContext[0].snsClkSource)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_SOURCE_OFFSET                             (59u)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_SOURCE_SIZE                               (1u)
#define CY_CAPSENSE_PROXIMITY0_SNS_CLK_SOURCE_PARAM_ID                           (0x0500003bu)

#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD0_VALUE                                   (cy_capsense_tuner.widgetContext[0].idacMod[0])
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD0_OFFSET                                  (60u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD0_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD0_PARAM_ID                                (0x0500003cu)

#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD1_VALUE                                   (cy_capsense_tuner.widgetContext[0].idacMod[1])
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD1_OFFSET                                  (61u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD1_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD1_PARAM_ID                                (0x0500003du)

#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD2_VALUE                                   (cy_capsense_tuner.widgetContext[0].idacMod[2])
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD2_OFFSET                                  (62u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD2_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_MOD2_PARAM_ID                                (0x0500003eu)

#define CY_CAPSENSE_PROXIMITY0_IDAC_GAIN_INDEX_VALUE                             (cy_capsense_tuner.widgetContext[0].idacGainIndex)
#define CY_CAPSENSE_PROXIMITY0_IDAC_GAIN_INDEX_OFFSET                            (63u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_GAIN_INDEX_SIZE                              (1u)
#define CY_CAPSENSE_PROXIMITY0_IDAC_GAIN_INDEX_PARAM_ID                          (0x0500003fu)

#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD0_VALUE                               (cy_capsense_tuner.widgetContext[0].rowIdacMod[0])
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD0_OFFSET                              (64u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD0_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD0_PARAM_ID                            (0x05000040u)

#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD1_VALUE                               (cy_capsense_tuner.widgetContext[0].rowIdacMod[1])
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD1_OFFSET                              (65u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD1_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD1_PARAM_ID                            (0x05000041u)

#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD2_VALUE                               (cy_capsense_tuner.widgetContext[0].rowIdacMod[2])
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD2_OFFSET                              (66u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD2_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITY0_ROW_IDAC_MOD2_PARAM_ID                            (0x05000042u)

