DELL-G15/PSoC62S2_RT_EVB_Radar_CSK_Proximity/Radar_Presence_Application_RT/libs/TARGET_CYSBSYSKIT-DEV-01/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_PROXIMITYW_XDELTA_VALUE                                      (cy_capsense_tuner.widgetContext[1].xDelta)
#define CY_CAPSENSE_PROXIMITYW_XDELTA_OFFSET                                     (104u)
#define CY_CAPSENSE_PROXIMITYW_XDELTA_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITYW_XDELTA_PARAM_ID                                   (0x02010068u)

#define CY_CAPSENSE_PROXIMITYW_YDELTA_VALUE                                      (cy_capsense_tuner.widgetContext[1].yDelta)
#define CY_CAPSENSE_PROXIMITYW_YDELTA_OFFSET                                     (106u)
#define CY_CAPSENSE_PROXIMITYW_YDELTA_SIZE                                       (2u)
#define CY_CAPSENSE_PROXIMITYW_YDELTA_PARAM_ID                                   (0x0201006au)

#define CY_CAPSENSE_PROXIMITYW_NOISE_TH_VALUE                                    (cy_capsense_tuner.widgetContext[1].noiseTh)
#define CY_CAPSENSE_PROXIMITYW_NOISE_TH_OFFSET                                   (108u)
#define CY_CAPSENSE_PROXIMITYW_NOISE_TH_SIZE                                     (2u)
#define CY_CAPSENSE_PROXIMITYW_NOISE_TH_PARAM_ID                                 (0x0601006cu)

#define CY_CAPSENSE_PROXIMITYW_NNOISE_TH_VALUE                                   (cy_capsense_tuner.widgetContext[1].nNoiseTh)
#define CY_CAPSENSE_PROXIMITYW_NNOISE_TH_OFFSET                                  (110u)
#define CY_CAPSENSE_PROXIMITYW_NNOISE_TH_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITYW_NNOISE_TH_PARAM_ID                                (0x0601006eu)

#define CY_CAPSENSE_PROXIMITYW_HYSTERESIS_VALUE                                  (cy_capsense_tuner.widgetContext[1].hysteresis)
#define CY_CAPSENSE_PROXIMITYW_HYSTERESIS_OFFSET                                 (112u)
#define CY_CAPSENSE_PROXIMITYW_HYSTERESIS_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITYW_HYSTERESIS_PARAM_ID                               (0x06010070u)

#define CY_CAPSENSE_PROXIMITYW_ON_DEBOUNCE_VALUE                                 (cy_capsense_tuner.widgetContext[1].onDebounce)
#define CY_CAPSENSE_PROXIMITYW_ON_DEBOUNCE_OFFSET                                (114u)
#define CY_CAPSENSE_PROXIMITYW_ON_DEBOUNCE_SIZE                                  (1u)
#define CY_CAPSENSE_PROXIMITYW_ON_DEBOUNCE_PARAM_ID                              (0x05010072u)

#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_SOURCE_VALUE                              (cy_capsense_tuner.widgetContext[1].snsClkSource)
#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_SOURCE_OFFSET                             (115u)
#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_SOURCE_SIZE                               (1u)
#define CY_CAPSENSE_PROXIMITYW_SNS_CLK_SOURCE_PARAM_ID                           (0x05010073u)

#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD0_VALUE                                   (cy_capsense_tuner.widgetContext[1].idacMod[0])
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD0_OFFSET                                  (116u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD0_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD0_PARAM_ID                                (0x05010074u)

#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD1_VALUE                                   (cy_capsense_tuner.widgetContext[1].idacMod[1])
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD1_OFFSET                                  (117u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD1_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD1_PARAM_ID                                (0x05010075u)

#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD2_VALUE                                   (cy_capsense_tuner.widgetContext[1].idacMod[2])
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD2_OFFSET                                  (118u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD2_SIZE                                    (1u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_MOD2_PARAM_ID                                (0x05010076u)

#define CY_CAPSENSE_PROXIMITYW_IDAC_GAIN_INDEX_VALUE                             (cy_capsense_tuner.widgetContext[1].idacGainIndex)
#define CY_CAPSENSE_PROXIMITYW_IDAC_GAIN_INDEX_OFFSET                            (119u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_GAIN_INDEX_SIZE                              (1u)
#define CY_CAPSENSE_PROXIMITYW_IDAC_GAIN_INDEX_PARAM_ID                          (0x05010077u)

#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD0_VALUE                               (cy_capsense_tuner.widgetContext[1].rowIdacMod[0])
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD0_OFFSET                              (120u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD0_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD0_PARAM_ID                            (0x05010078u)

#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD1_VALUE                               (cy_capsense_tuner.widgetContext[1].rowIdacMod[1])
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD1_OFFSET                              (121u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD1_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD1_PARAM_ID                            (0x05010079u)

#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD2_VALUE                               (cy_capsense_tuner.widgetContext[1].rowIdacMod[2])
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD2_OFFSET                              (122u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD2_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITYW_ROW_IDAC_MOD2_PARAM_ID                            (0x0501007au)

#define CY_CAPSENSE_PROXIMITYW_PROX_IIR_BL_N_VALUE                               (cy_capsense_tuner.widgetContext[1].bslnCoeff)
#define CY_CAPSENSE_PROXIMITYW_PROX_IIR_BL_N_OFFSET                              (123u)
#define CY_CAPSENSE_PROXIMITYW_PROX_IIR_BL_N_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITYW_PROX_IIR_BL_N_PARAM_ID                            (0x0101007bu)

#define CY_CAPSENSE_PROXIMITYW_STATUS_VALUE                                      (cy_capsense_tuner.widgetContext[1].status)
#define CY_CAPSENSE_PROXIMITYW_STATUS_OFFSET                                     (124u)
#define CY_CAPSENSE_PROXIMITYW_STATUS_SIZE                                       (1u)
#define CY_CAPSENSE_PROXIMITYW_STATUS_PARAM_ID                                   (0x0101007cu)

#define CY_CAPSENSE_PROXIMITYW_PTRPOSITION_VALUE                                 (cy_capsense_tuner.widgetContext[1].wdTouch.ptrPosition)
#define CY_CAPSENSE_PROXIMITYW_PTRPOSITION_OFFSET                                (128u)
#define CY_CAPSENSE_PROXIMITYW_PTRPOSITION_SIZE                                  (4u)
#define CY_CAPSENSE_PROXIMITYW_PTRPOSITION_PARAM_ID                              (0x03010080u)

