DELL-G15/PSoC62S2_RT_EVB_Radar_CSK_Proximity/Radar_Presence_Application_RT/libs/TARGET_CYSBSYSKIT-DEV-01/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_PROXIMITYW_NUM_POSITIONS_VALUE                               (cy_capsense_tuner.widgetContext[1].wdTouch.numPosition)
#define CY_CAPSENSE_PROXIMITYW_NUM_POSITIONS_OFFSET                              (132u)
#define CY_CAPSENSE_PROXIMITYW_NUM_POSITIONS_SIZE                                (1u)
#define CY_CAPSENSE_PROXIMITYW_NUM_POSITIONS_PARAM_ID                            (0x01010084u)

#define CY_CAPSENSE_PROXIMITY0_SNS0_RAW0_VALUE                                   (cy_capsense_tuner.sensorContext[0].raw)
#define CY_CAPSENSE_PROXIMITY0_SNS0_RAW0_OFFSET                                  (136u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_RAW0_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_RAW0_PARAM_ID                                (0x02000088u)

#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN0_VALUE                                  (cy_capsense_tuner.sensorContext[0].bsln)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN0_OFFSET                                 (138u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN0_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN0_PARAM_ID                               (0x0200008au)

#define CY_CAPSENSE_PROXIMITY0_SNS0_DIFF0_VALUE                                  (cy_capsense_tuner.sensorContext[0].diff)
#define CY_CAPSENSE_PROXIMITY0_SNS0_DIFF0_OFFSET                                 (140u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_DIFF0_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_DIFF0_PARAM_ID                               (0x0200008cu)

#define CY_CAPSENSE_PROXIMITY0_SNS0_STATUS0_VALUE                                (cy_capsense_tuner.sensorContext[0].status)
#define CY_CAPSENSE_PROXIMITY0_SNS0_STATUS0_OFFSET                               (142u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_STATUS0_SIZE                                 (1u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_STATUS0_PARAM_ID                             (0x0100008eu)

#define CY_CAPSENSE_PROXIMITY0_SNS0_NEG_BSLN_RST_CNT0_VALUE                      (cy_capsense_tuner.sensorContext[0].negBslnRstCnt)
#define CY_CAPSENSE_PROXIMITY0_SNS0_NEG_BSLN_RST_CNT0_OFFSET                     (143u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_NEG_BSLN_RST_CNT0_SIZE                       (1u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_NEG_BSLN_RST_CNT0_PARAM_ID                   (0x0100008fu)

#define CY_CAPSENSE_PROXIMITY0_SNS0_IDAC0_VALUE                                  (cy_capsense_tuner.sensorContext[0].idacComp)
#define CY_CAPSENSE_PROXIMITY0_SNS0_IDAC0_OFFSET                                 (144u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_IDAC0_SIZE                                   (1u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_IDAC0_PARAM_ID                               (0x01000090u)

#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN_EXT0_VALUE                              (cy_capsense_tuner.sensorContext[0].bslnExt)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN_EXT0_OFFSET                             (145u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN_EXT0_SIZE                               (1u)
#define CY_CAPSENSE_PROXIMITY0_SNS0_BSLN_EXT0_PARAM_ID                           (0x01000091u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_RAW0_VALUE                                   (cy_capsense_tuner.sensorContext[1].raw)
#define CY_CAPSENSE_PROXIMITYW_SNS0_RAW0_OFFSET                                  (146u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_RAW0_SIZE                                    (2u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_RAW0_PARAM_ID                                (0x02010092u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN0_VALUE                                  (cy_capsense_tuner.sensorContext[1].bsln)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN0_OFFSET                                 (148u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN0_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN0_PARAM_ID                               (0x02010094u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_DIFF0_VALUE                                  (cy_capsense_tuner.sensorContext[1].diff)
#define CY_CAPSENSE_PROXIMITYW_SNS0_DIFF0_OFFSET                                 (150u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_DIFF0_SIZE                                   (2u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_DIFF0_PARAM_ID                               (0x02010096u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_STATUS0_VALUE                                (cy_capsense_tuner.sensorContext[1].status)
#define CY_CAPSENSE_PROXIMITYW_SNS0_STATUS0_OFFSET                               (152u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_STATUS0_SIZE                                 (1u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_STATUS0_PARAM_ID                             (0x01010098u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_NEG_BSLN_RST_CNT0_VALUE                      (cy_capsense_tuner.sensorContext[1].negBslnRstCnt)
#define CY_CAPSENSE_PROXIMITYW_SNS0_NEG_BSLN_RST_CNT0_OFFSET                     (153u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_NEG_BSLN_RST_CNT0_SIZE                       (1u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_NEG_BSLN_RST_CNT0_PARAM_ID                   (0x01010099u)

#define CY_CAPSENSE_PROXIMITYW_SNS0_IDAC0_VALUE                                  (cy_capsense_tuner.sensorContext[1].idacComp)
#define CY_CAPSENSE_PROXIMITYW_SNS0_IDAC0_OFFSET                                 (154u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_IDAC0_SIZE                                   (1u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_IDAC0_PARAM_ID                               (0x0101009au)

#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN_EXT0_VALUE                              (cy_capsense_tuner.sensorContext[1].bslnExt)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN_EXT0_OFFSET                             (155u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN_EXT0_SIZE                               (1u)
#define CY_CAPSENSE_PROXIMITYW_SNS0_BSLN_EXT0_PARAM_ID                           (0x0101009bu)

#endif
/* cy_capsense_context */
#define CY_CAPSENSE_COMMON_CONFIG_PTR_VALUE                                      (cy_capsense_context.ptrCommonConfig)
#define CY_CAPSENSE_COMMON_CONFIG_PTR_SIZE                                       (sizeof(cy_capsense_context.ptrCommonConfig))

#define CY_CAPSENSE_COMMON_CONTEXT_PTR_VALUE                                     (cy_capsense_context.ptrCommonContext)
#define CY_CAPSENSE_COMMON_CONTEXT_PTR_SIZE                                      (sizeof(cy_capsense_context.ptrCommonContext))

#define CY_CAPSENSE_INTERNAL_CONTEXT_PTR_VALUE                                   (cy_capsense_context.ptrInternalContext)
#define CY_CAPSENSE_INTERNAL_CONTEXT_PTR_SIZE                                    (sizeof(cy_capsense_context.ptrInternalContext))

