DELL-G15/PSoC62S2_RT_EVB_Radar_CSK_Proximity/Radar_Presence_Application_RT/libs/TARGET_CYSBSYSKIT-DEV-01/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_CSD_MFS_DIVIDER_OFFSET_F2_VALUE                              (cy_capsense_context.ptrCommonConfig->csdMfsDividerOffsetF2)
#define CY_CAPSENSE_CSD_MFS_DIVIDER_OFFSET_F2_SIZE                               (sizeof(cy_capsense_context.ptrCommonConfig->csdMfsDividerOffsetF2))

#define CY_CAPSENSE_CSX_RAW_TARGET_VALUE                                         (cy_capsense_context.ptrCommonConfig->csxRawTarget)
#define CY_CAPSENSE_CSX_RAW_TARGET_SIZE                                          (sizeof(cy_capsense_context.ptrCommonConfig->csxRawTarget))

#define CY_CAPSENSE_CSX_IDAC_GAIN_INIT_INDEX_VALUE                               (cy_capsense_context.ptrCommonConfig->csxIdacGainInitIndex)
#define CY_CAPSENSE_CSX_IDAC_GAIN_INIT_INDEX_SIZE                                (sizeof(cy_capsense_context.ptrCommonConfig->csxIdacGainInitIndex))

#define CY_CAPSENSE_CSX_REF_GAIN_VALUE                                           (cy_capsense_context.ptrCommonConfig->csxRefGain)
#define CY_CAPSENSE_CSX_REF_GAIN_SIZE                                            (sizeof(cy_capsense_context.ptrCommonConfig->csxRefGain))

#define CY_CAPSENSE_CSX_IDAC_AUTOCAL_EN_VALUE                                    (cy_capsense_context.ptrCommonConfig->csxIdacAutocalEn)
#define CY_CAPSENSE_CSX_IDAC_AUTOCAL_EN_SIZE                                     (sizeof(cy_capsense_context.ptrCommonConfig->csxIdacAutocalEn))

#define CY_CAPSENSE_CSX_CALIBRATION_ERROR_VALUE                                  (cy_capsense_context.ptrCommonConfig->csxCalibrationError)
#define CY_CAPSENSE_CSX_CALIBRATION_ERROR_SIZE                                   (sizeof(cy_capsense_context.ptrCommonConfig->csxCalibrationError))

#define CY_CAPSENSE_CSX_FINE_INIT_TIME_VALUE                                     (cy_capsense_context.ptrCommonConfig->csxFineInitTime)
#define CY_CAPSENSE_CSX_FINE_INIT_TIME_SIZE                                      (sizeof(cy_capsense_context.ptrCommonConfig->csxFineInitTime))

#define CY_CAPSENSE_CSX_INIT_SW_RES_VALUE                                        (cy_capsense_context.ptrCommonConfig->csxInitSwRes)
#define CY_CAPSENSE_CSX_INIT_SW_RES_SIZE                                         (sizeof(cy_capsense_context.ptrCommonConfig->csxInitSwRes))

#define CY_CAPSENSE_CSX_SCAN_SW_RES_VALUE                                        (cy_capsense_context.ptrCommonConfig->csxScanSwRes)
#define CY_CAPSENSE_CSX_SCAN_SW_RES_SIZE                                         (sizeof(cy_capsense_context.ptrCommonConfig->csxScanSwRes))

#define CY_CAPSENSE_CSX_INIT_SHIELD_SW_RES_VALUE                                 (cy_capsense_context.ptrCommonConfig->csxInitShieldSwRes)
#define CY_CAPSENSE_CSX_INIT_SHIELD_SW_RES_SIZE                                  (sizeof(cy_capsense_context.ptrCommonConfig->csxInitShieldSwRes))

#define CY_CAPSENSE_CSX_SCAN_SHIELD_SW_RES_VALUE                                 (cy_capsense_context.ptrCommonConfig->csxScanShieldSwRes)
#define CY_CAPSENSE_CSX_SCAN_SHIELD_SW_RES_SIZE                                  (sizeof(cy_capsense_context.ptrCommonConfig->csxScanShieldSwRes))

#define CY_CAPSENSE_CSX_MFS_DIVIDER_OFFSET_F1_VALUE                              (cy_capsense_context.ptrCommonConfig->csxMfsDividerOffsetF1)
#define CY_CAPSENSE_CSX_MFS_DIVIDER_OFFSET_F1_SIZE                               (sizeof(cy_capsense_context.ptrCommonConfig->csxMfsDividerOffsetF1))

#define CY_CAPSENSE_CSX_MFS_DIVIDER_OFFSET_F2_VALUE                              (cy_capsense_context.ptrCommonConfig->csxMfsDividerOffsetF2)
#define CY_CAPSENSE_CSX_MFS_DIVIDER_OFFSET_F2_SIZE                               (sizeof(cy_capsense_context.ptrCommonConfig->csxMfsDividerOffsetF2))

/* cy_capsense_widgetConfig */
#define CY_CAPSENSE_PROXIMITY0_PTR_WD_CONTEXT_VALUE                              (cy_capsense_context.ptrWdConfig[0u].ptrWdContext)
#define CY_CAPSENSE_PROXIMITY0_PTR_WD_CONTEXT_SIZE                               (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrWdContext))
#define CY_CAPSENSE_PROXIMITY0_PTR_SNS_CONTEXT_VALUE                             (cy_capsense_context.ptrWdConfig[0u].ptrSnsContext)
#define CY_CAPSENSE_PROXIMITY0_PTR_SNS_CONTEXT_SIZE                              (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrSnsContext))
#define CY_CAPSENSE_PROXIMITY0_PTR_ELTD_CONTEXT_VALUE                            (cy_capsense_context.ptrWdConfig[0u].ptrEltdConfig)
#define CY_CAPSENSE_PROXIMITY0_PTR_ELTD_CONTEXT_SIZE                             (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrEltdConfig))
#define CY_CAPSENSE_PROXIMITY0_PTR_ELTD_CAPACITANCE_VALUE                        (cy_capsense_context.ptrWdConfig[0u].ptrEltdCapacitance)
#define CY_CAPSENSE_PROXIMITY0_PTR_ELTD_CAPACITANCE_SIZE                         (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrEltdCapacitance))
#define CY_CAPSENSE_PROXIMITY0_PTR_BSLN_INV_VALUE                                (cy_capsense_context.ptrWdConfig[0u].ptrBslnInv)
#define CY_CAPSENSE_PROXIMITY0_PTR_BSLN_INV_SIZE                                 (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrBslnInv))
#define CY_CAPSENSE_PROXIMITY0_PTR_NOISE_ENVELOPE_VALUE                          (cy_capsense_context.ptrWdConfig[0u].ptrNoiseEnvelope)
#define CY_CAPSENSE_PROXIMITY0_PTR_NOISE_ENVELOPE_SIZE                           (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrNoiseEnvelope))
#define CY_CAPSENSE_PROXIMITY0_PTR_RAW_FILTER_HISTORY_VALUE                      (cy_capsense_context.ptrWdConfig[0u].ptrRawFilterHistory)
#define CY_CAPSENSE_PROXIMITY0_PTR_RAW_FILTER_HISTORY_SIZE                       (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrRawFilterHistory))
#define CY_CAPSENSE_PROXIMITY0_PTR_RAW_FILTER_HISTORY_LOW_VALUE                  (cy_capsense_context.ptrWdConfig[0u].ptrRawFilterHistoryLow)
#define CY_CAPSENSE_PROXIMITY0_PTR_RAW_FILTER_HISTORY_LOW_SIZE                   (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrRawFilterHistoryLow))
#define CY_CAPSENSE_PROXIMITY0_IIR_COEFF_VALUE                                   (cy_capsense_context.ptrWdConfig[0u].iirCoeff)
#define CY_CAPSENSE_PROXIMITY0_IIR_COEFF_SIZE                                    (sizeof(cy_capsense_context.ptrWdConfig[0u].iirCoeff))
#define CY_CAPSENSE_PROXIMITY0_PTR_DEBOUNCE_ARR_VALUE                            (cy_capsense_context.ptrWdConfig[0u].ptrDebounceArr)
#define CY_CAPSENSE_PROXIMITY0_PTR_DEBOUNCE_ARR_SIZE                             (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrDebounceArr))
#define CY_CAPSENSE_PROXIMITY0_PTR_DIPLEX_TABLE_VALUE                            (cy_capsense_context.ptrWdConfig[0u].ptrDiplexTable)
#define CY_CAPSENSE_PROXIMITY0_PTR_DIPLEX_TABLE_SIZE                             (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrDiplexTable))
#define CY_CAPSENSE_PROXIMITY0_CENTROID_CONFIG_VALUE                             (cy_capsense_context.ptrWdConfig[0u].centroidConfig)
#define CY_CAPSENSE_PROXIMITY0_CENTROID_CONFIG_SIZE                              (sizeof(cy_capsense_context.ptrWdConfig[0u].centroidConfig))
#define CY_CAPSENSE_PROXIMITY0_X_RESOLUTION_VALUE                                (cy_capsense_context.ptrWdConfig[0u].xResolution)
#define CY_CAPSENSE_PROXIMITY0_X_RESOLUTION_SIZE                                 (sizeof(cy_capsense_context.ptrWdConfig[0u].xResolution))
#define CY_CAPSENSE_PROXIMITY0_Y_RESOLUTION_VALUE                                (cy_capsense_context.ptrWdConfig[0u].yResolution)
#define CY_CAPSENSE_PROXIMITY0_Y_RESOLUTION_SIZE                                 (sizeof(cy_capsense_context.ptrWdConfig[0u].yResolution))
#define CY_CAPSENSE_PROXIMITY0_NUM_SNS_VALUE                                     (cy_capsense_context.ptrWdConfig[0u].numSns)
#define CY_CAPSENSE_PROXIMITY0_NUM_SNS_SIZE                                      (sizeof(cy_capsense_context.ptrWdConfig[0u].numSns))
#define CY_CAPSENSE_PROXIMITY0_NUM_COLS_VALUE                                    (cy_capsense_context.ptrWdConfig[0u].numCols)
#define CY_CAPSENSE_PROXIMITY0_NUM_COLS_SIZE                                     (sizeof(cy_capsense_context.ptrWdConfig[0u].numCols))
#define CY_CAPSENSE_PROXIMITY0_NUM_ROWS_VALUE                                    (cy_capsense_context.ptrWdConfig[0u].numRows)
#define CY_CAPSENSE_PROXIMITY0_NUM_ROWS_SIZE                                     (sizeof(cy_capsense_context.ptrWdConfig[0u].numRows))
#define CY_CAPSENSE_PROXIMITY0_PTR_POS_FILTER_HISTORY_VALUE                      (cy_capsense_context.ptrWdConfig[0u].ptrPosFilterHistory)
#define CY_CAPSENSE_PROXIMITY0_PTR_POS_FILTER_HISTORY_SIZE                       (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrPosFilterHistory))
#define CY_CAPSENSE_PROXIMITY0_PTR_CSX_TOUCH_HISTORY_VALUE                       (cy_capsense_context.ptrWdConfig[0u].ptrCsxTouchHistory)
#define CY_CAPSENSE_PROXIMITY0_PTR_CSX_TOUCH_HISTORY_SIZE                        (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrCsxTouchHistory))
#define CY_CAPSENSE_PROXIMITY0_PTR_CSX_TOUCH_BUFFER_VALUE                        (cy_capsense_context.ptrWdConfig[0u].ptrCsxTouchBuffer)
#define CY_CAPSENSE_PROXIMITY0_PTR_CSX_TOUCH_BUFFER_SIZE                         (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrCsxTouchBuffer))
#define CY_CAPSENSE_PROXIMITY0_PTR_CSD_TOUCH_BUFFER_VALUE                        (cy_capsense_context.ptrWdConfig[0u].ptrCsdTouchBuffer)
#define CY_CAPSENSE_PROXIMITY0_PTR_CSD_TOUCH_BUFFER_SIZE                         (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrCsdTouchBuffer))
#define CY_CAPSENSE_PROXIMITY0_PTR_GESTURE_CONFIG_VALUE                          (cy_capsense_context.ptrWdConfig[0u].ptrGestureConfig)
#define CY_CAPSENSE_PROXIMITY0_PTR_GESTURE_CONFIG_SIZE                           (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrGestureConfig))
#define CY_CAPSENSE_PROXIMITY0_PTR_GESTURE_CONTEXT_VALUE                         (cy_capsense_context.ptrWdConfig[0u].ptrGestureContext)
#define CY_CAPSENSE_PROXIMITY0_PTR_GESTURE_CONTEXT_SIZE                          (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrGestureContext))
#define CY_CAPSENSE_PROXIMITY0_BALLISTIC_CONFIG_VALUE                            (cy_capsense_context.ptrWdConfig[0u].ballisticConfig)
#define CY_CAPSENSE_PROXIMITY0_BALLISTIC_CONFIG_SIZE                             (sizeof(cy_capsense_context.ptrWdConfig[0u].ballisticConfig))
#define CY_CAPSENSE_PROXIMITY0_PTR_BALLISTIC_CONTEXT_VALUE                       (cy_capsense_context.ptrWdConfig[0u].ptrBallisticContext)
#define CY_CAPSENSE_PROXIMITY0_PTR_BALLISTIC_CONTEXT_SIZE                        (sizeof(cy_capsense_context.ptrWdConfig[0u].ptrBallisticContext))
#define CY_CAPSENSE_PROXIMITY0_AIIR_CONFIG_VALUE                                 (cy_capsense_context.ptrWdConfig[0u].aiirConfig)
#define CY_CAPSENSE_PROXIMITY0_AIIR_CONFIG_SIZE                                  (sizeof(cy_capsense_context.ptrWdConfig[0u].aiirConfig))
#define CY_CAPSENSE_PROXIMITY0_ADV_CONFIG_VALUE                                  (cy_capsense_context.ptrWdConfig[0u].advConfig)
#define CY_CAPSENSE_PROXIMITY0_ADV_CONFIG_SIZE                                   (sizeof(cy_capsense_context.ptrWdConfig[0u].advConfig))
#define CY_CAPSENSE_PROXIMITY0_POS_FILTER_CONFIG_VALUE                           (cy_capsense_context.ptrWdConfig[0u].posFilterConfig)
#define CY_CAPSENSE_PROXIMITY0_POS_FILTER_CONFIG_SIZE                            (sizeof(cy_capsense_context.ptrWdConfig[0u].posFilterConfig))
#define CY_CAPSENSE_PROXIMITY0_RAW_FILTER_CONFIG_VALUE                           (cy_capsense_context.ptrWdConfig[0u].rawFilterConfig)
#define CY_CAPSENSE_PROXIMITY0_RAW_FILTER_CONFIG_SIZE                            (sizeof(cy_capsense_context.ptrWdConfig[0u].rawFilterConfig))
#define CY_CAPSENSE_PROXIMITY0_SENSE_METHOD_VALUE                                (cy_capsense_context.ptrWdConfig[0u].senseMethod)
#define CY_CAPSENSE_PROXIMITY0_SENSE_METHOD_SIZE                                 (sizeof(cy_capsense_context.ptrWdConfig[0u].senseMethod))
#define CY_CAPSENSE_PROXIMITY0_WD_TYPE_VALUE                                     (cy_capsense_context.ptrWdConfig[0u].wdType)
#define CY_CAPSENSE_PROXIMITY0_WD_TYPE_SIZE                                      (sizeof(cy_capsense_context.ptrWdConfig[0u].wdType))

#define CY_CAPSENSE_PROXIMITYW_PTR_WD_CONTEXT_VALUE                              (cy_capsense_context.ptrWdConfig[1u].ptrWdContext)
#define CY_CAPSENSE_PROXIMITYW_PTR_WD_CONTEXT_SIZE                               (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrWdContext))
#define CY_CAPSENSE_PROXIMITYW_PTR_SNS_CONTEXT_VALUE                             (cy_capsense_context.ptrWdConfig[1u].ptrSnsContext)
#define CY_CAPSENSE_PROXIMITYW_PTR_SNS_CONTEXT_SIZE                              (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrSnsContext))
#define CY_CAPSENSE_PROXIMITYW_PTR_ELTD_CONTEXT_VALUE                            (cy_capsense_context.ptrWdConfig[1u].ptrEltdConfig)
#define CY_CAPSENSE_PROXIMITYW_PTR_ELTD_CONTEXT_SIZE                             (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrEltdConfig))
#define CY_CAPSENSE_PROXIMITYW_PTR_ELTD_CAPACITANCE_VALUE                        (cy_capsense_context.ptrWdConfig[1u].ptrEltdCapacitance)
#define CY_CAPSENSE_PROXIMITYW_PTR_ELTD_CAPACITANCE_SIZE                         (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrEltdCapacitance))
#define CY_CAPSENSE_PROXIMITYW_PTR_BSLN_INV_VALUE                                (cy_capsense_context.ptrWdConfig[1u].ptrBslnInv)
#define CY_CAPSENSE_PROXIMITYW_PTR_BSLN_INV_SIZE                                 (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrBslnInv))
#define CY_CAPSENSE_PROXIMITYW_PTR_NOISE_ENVELOPE_VALUE                          (cy_capsense_context.ptrWdConfig[1u].ptrNoiseEnvelope)
#define CY_CAPSENSE_PROXIMITYW_PTR_NOISE_ENVELOPE_SIZE                           (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrNoiseEnvelope))
#define CY_CAPSENSE_PROXIMITYW_PTR_RAW_FILTER_HISTORY_VALUE                      (cy_capsense_context.ptrWdConfig[1u].ptrRawFilterHistory)
#define CY_CAPSENSE_PROXIMITYW_PTR_RAW_FILTER_HISTORY_SIZE                       (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrRawFilterHistory))
#define CY_CAPSENSE_PROXIMITYW_PTR_RAW_FILTER_HISTORY_LOW_VALUE                  (cy_capsense_context.ptrWdConfig[1u].ptrRawFilterHistoryLow)
#define CY_CAPSENSE_PROXIMITYW_PTR_RAW_FILTER_HISTORY_LOW_SIZE                   (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrRawFilterHistoryLow))
#define CY_CAPSENSE_PROXIMITYW_IIR_COEFF_VALUE                                   (cy_capsense_context.ptrWdConfig[1u].iirCoeff)
#define CY_CAPSENSE_PROXIMITYW_IIR_COEFF_SIZE                                    (sizeof(cy_capsense_context.ptrWdConfig[1u].iirCoeff))
#define CY_CAPSENSE_PROXIMITYW_PTR_DEBOUNCE_ARR_VALUE                            (cy_capsense_context.ptrWdConfig[1u].ptrDebounceArr)
#define CY_CAPSENSE_PROXIMITYW_PTR_DEBOUNCE_ARR_SIZE                             (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrDebounceArr))
#define CY_CAPSENSE_PROXIMITYW_PTR_DIPLEX_TABLE_VALUE                            (cy_capsense_context.ptrWdConfig[1u].ptrDiplexTable)
#define CY_CAPSENSE_PROXIMITYW_PTR_DIPLEX_TABLE_SIZE                             (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrDiplexTable))
#define CY_CAPSENSE_PROXIMITYW_CENTROID_CONFIG_VALUE                             (cy_capsense_context.ptrWdConfig[1u].centroidConfig)
#define CY_CAPSENSE_PROXIMITYW_CENTROID_CONFIG_SIZE                              (sizeof(cy_capsense_context.ptrWdConfig[1u].centroidConfig))
#define CY_CAPSENSE_PROXIMITYW_X_RESOLUTION_VALUE                                (cy_capsense_context.ptrWdConfig[1u].xResolution)
#define CY_CAPSENSE_PROXIMITYW_X_RESOLUTION_SIZE                                 (sizeof(cy_capsense_context.ptrWdConfig[1u].xResolution))
#define CY_CAPSENSE_PROXIMITYW_Y_RESOLUTION_VALUE                                (cy_capsense_context.ptrWdConfig[1u].yResolution)
#define CY_CAPSENSE_PROXIMITYW_Y_RESOLUTION_SIZE                                 (sizeof(cy_capsense_context.ptrWdConfig[1u].yResolution))
#define CY_CAPSENSE_PROXIMITYW_NUM_SNS_VALUE                                     (cy_capsense_context.ptrWdConfig[1u].numSns)
#define CY_CAPSENSE_PROXIMITYW_NUM_SNS_SIZE                                      (sizeof(cy_capsense_context.ptrWdConfig[1u].numSns))
#define CY_CAPSENSE_PROXIMITYW_NUM_COLS_VALUE                                    (cy_capsense_context.ptrWdConfig[1u].numCols)
#define CY_CAPSENSE_PROXIMITYW_NUM_COLS_SIZE                                     (sizeof(cy_capsense_context.ptrWdConfig[1u].numCols))
#define CY_CAPSENSE_PROXIMITYW_NUM_ROWS_VALUE                                    (cy_capsense_context.ptrWdConfig[1u].numRows)
#define CY_CAPSENSE_PROXIMITYW_NUM_ROWS_SIZE                                     (sizeof(cy_capsense_context.ptrWdConfig[1u].numRows))
#define CY_CAPSENSE_PROXIMITYW_PTR_POS_FILTER_HISTORY_VALUE                      (cy_capsense_context.ptrWdConfig[1u].ptrPosFilterHistory)
#define CY_CAPSENSE_PROXIMITYW_PTR_POS_FILTER_HISTORY_SIZE                       (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrPosFilterHistory))
#define CY_CAPSENSE_PROXIMITYW_PTR_CSX_TOUCH_HISTORY_VALUE                       (cy_capsense_context.ptrWdConfig[1u].ptrCsxTouchHistory)
#define CY_CAPSENSE_PROXIMITYW_PTR_CSX_TOUCH_HISTORY_SIZE                        (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrCsxTouchHistory))
#define CY_CAPSENSE_PROXIMITYW_PTR_CSX_TOUCH_BUFFER_VALUE                        (cy_capsense_context.ptrWdConfig[1u].ptrCsxTouchBuffer)
#define CY_CAPSENSE_PROXIMITYW_PTR_CSX_TOUCH_BUFFER_SIZE                         (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrCsxTouchBuffer))
#define CY_CAPSENSE_PROXIMITYW_PTR_CSD_TOUCH_BUFFER_VALUE                        (cy_capsense_context.ptrWdConfig[1u].ptrCsdTouchBuffer)
#define CY_CAPSENSE_PROXIMITYW_PTR_CSD_TOUCH_BUFFER_SIZE                         (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrCsdTouchBuffer))
#define CY_CAPSENSE_PROXIMITYW_PTR_GESTURE_CONFIG_VALUE                          (cy_capsense_context.ptrWdConfig[1u].ptrGestureConfig)
#define CY_CAPSENSE_PROXIMITYW_PTR_GESTURE_CONFIG_SIZE                           (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrGestureConfig))
#define CY_CAPSENSE_PROXIMITYW_PTR_GESTURE_CONTEXT_VALUE                         (cy_capsense_context.ptrWdConfig[1u].ptrGestureContext)
#define CY_CAPSENSE_PROXIMITYW_PTR_GESTURE_CONTEXT_SIZE                          (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrGestureContext))
#define CY_CAPSENSE_PROXIMITYW_BALLISTIC_CONFIG_VALUE                            (cy_capsense_context.ptrWdConfig[1u].ballisticConfig)
#define CY_CAPSENSE_PROXIMITYW_BALLISTIC_CONFIG_SIZE                             (sizeof(cy_capsense_context.ptrWdConfig[1u].ballisticConfig))
#define CY_CAPSENSE_PROXIMITYW_PTR_BALLISTIC_CONTEXT_VALUE                       (cy_capsense_context.ptrWdConfig[1u].ptrBallisticContext)
#define CY_CAPSENSE_PROXIMITYW_PTR_BALLISTIC_CONTEXT_SIZE                        (sizeof(cy_capsense_context.ptrWdConfig[1u].ptrBallisticContext))
#define CY_CAPSENSE_PROXIMITYW_AIIR_CONFIG_VALUE                                 (cy_capsense_context.ptrWdConfig[1u].aiirConfig)
#define CY_CAPSENSE_PROXIMITYW_AIIR_CONFIG_SIZE                                  (sizeof(cy_capsense_context.ptrWdConfig[1u].aiirConfig))
#define CY_CAPSENSE_PROXIMITYW_ADV_CONFIG_VALUE                                  (cy_capsense_context.ptrWdConfig[1u].advConfig)
#define CY_CAPSENSE_PROXIMITYW_ADV_CONFIG_SIZE                                   (sizeof(cy_capsense_context.ptrWdConfig[1u].advConfig))
#define CY_CAPSENSE_PROXIMITYW_POS_FILTER_CONFIG_VALUE                           (cy_capsense_context.ptrWdConfig[1u].posFilterConfig)
#define CY_CAPSENSE_PROXIMITYW_POS_FILTER_CONFIG_SIZE                            (sizeof(cy_capsense_context.ptrWdConfig[1u].posFilterConfig))
#define CY_CAPSENSE_PROXIMITYW_RAW_FILTER_CONFIG_VALUE                           (cy_capsense_context.ptrWdConfig[1u].rawFilterConfig)
#define CY_CAPSENSE_PROXIMITYW_RAW_FILTER_CONFIG_SIZE                            (sizeof(cy_capsense_context.ptrWdConfig[1u].rawFilterConfig))
#define CY_CAPSENSE_PROXIMITYW_SENSE_METHOD_VALUE                                (cy_capsense_context.ptrWdConfig[1u].senseMethod)
#define CY_CAPSENSE_PROXIMITYW_SENSE_METHOD_SIZE                                 (sizeof(cy_capsense_context.ptrWdConfig[1u].senseMethod))
#define CY_CAPSENSE_PROXIMITYW_WD_TYPE_VALUE                                     (cy_capsense_context.ptrWdConfig[1u].wdType)
#define CY_CAPSENSE_PROXIMITYW_WD_TYPE_SIZE                                      (sizeof(cy_capsense_context.ptrWdConfig[1u].wdType))

/* cy_capsense_pinConfig */
#define CY_CAPSENSE_PROXIMITY0_SNS0_PIN0_PC_PTR_VALUE                            (cy_capsense_context.ptrPinConfig[0].pcPtr)
#define CY_CAPSENSE_PROXIMITY0_SNS0_PIN0_PC_PTR_SIZE                             (sizeof(cy_capsense_context.ptrPinConfig[0].pcPtr))
#define CY_CAPSENSE_PROXIMITY0_SNS0_PIN0_NUMBER_VALUE                            (cy_capsense_context.ptrPinConfig[0].pinNumber)
#define CY_CAPSENSE_PROXIMITY0_SNS0_PIN0_NUMBER_SIZE                             (sizeof(cy_capsense_context.ptrPinConfig[0].pinNumber))

#define CY_CAPSENSE_PROXIMITYW_SNS0_PIN0_PC_PTR_VALUE                            (cy_capsense_context.ptrPinConfig[1].pcPtr)
#define CY_CAPSENSE_PROXIMITYW_SNS0_PIN0_PC_PTR_SIZE                             (sizeof(cy_capsense_context.ptrPinConfig[1].pcPtr))
#define CY_CAPSENSE_PROXIMITYW_SNS0_PIN0_NUMBER_VALUE                            (cy_capsense_context.ptrPinConfig[1].pinNumber)
#define CY_CAPSENSE_PROXIMITYW_SNS0_PIN0_NUMBER_SIZE                             (sizeof(cy_capsense_context.ptrPinConfig[1].pinNumber))

