DELL-G15/PSoC62S2_RT_EVB_Radar_CSK_Proximity/Radar_Presence_Application_RT/libs/TARGET_CYSBSYSKIT-DEV-01/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
/* cy_capsense_electrodeConfig */
#define CY_CAPSENSE_PROXIMITY0_SNS0_CFG_PTR_VALUE                                (cy_capsense_context.ptrWdConfig[0].ptrEltdConfig[0].ptrPin)
#define CY_CAPSENSE_PROXIMITY0_SNS0_CFG_PTR_SIZE                                 (sizeof(cy_capsense_context.ptrWdConfig[0].ptrEltdConfig[0].ptrPin))
#define CY_CAPSENSE_PROXIMITY0_SNS0_ELTD_TYPE_VALUE                              (cy_capsense_context.ptrWdConfig[0].ptrEltdConfig[0].type)
#define CY_CAPSENSE_PROXIMITY0_SNS0_ELTD_TYPE_SIZE                               (sizeof(cy_capsense_context.ptrWdConfig[0].ptrEltdConfig[0].type))
#define CY_CAPSENSE_PROXIMITY0_SNS0_NUM_PINS_VALUE                               (cy_capsense_context.ptrWdConfig[0].ptrEltdConfig[0].numPins)
#define CY_CAPSENSE_PROXIMITY0_SNS0_NUM_PINS_SIZE                                (sizeof(cy_capsense_context.ptrWdConfig[0].ptrEltdConfig[0].numPins))

#define CY_CAPSENSE_PROXIMITYW_SNS0_CFG_PTR_VALUE                                (cy_capsense_context.ptrWdConfig[1].ptrEltdConfig[0].ptrPin)
#define CY_CAPSENSE_PROXIMITYW_SNS0_CFG_PTR_SIZE                                 (sizeof(cy_capsense_context.ptrWdConfig[1].ptrEltdConfig[0].ptrPin))
#define CY_CAPSENSE_PROXIMITYW_SNS0_ELTD_TYPE_VALUE                              (cy_capsense_context.ptrWdConfig[1].ptrEltdConfig[0].type)
#define CY_CAPSENSE_PROXIMITYW_SNS0_ELTD_TYPE_SIZE                               (sizeof(cy_capsense_context.ptrWdConfig[1].ptrEltdConfig[0].type))
#define CY_CAPSENSE_PROXIMITYW_SNS0_NUM_PINS_VALUE                               (cy_capsense_context.ptrWdConfig[1].ptrEltdConfig[0].numPins)
#define CY_CAPSENSE_PROXIMITYW_SNS0_NUM_PINS_SIZE                                (sizeof(cy_capsense_context.ptrWdConfig[1].ptrEltdConfig[0].numPins))


#if ((CY_CAPSENSE_PERI_CLK / 8) > 50000000)
    #warning The maximum CSD modulator clock frequency is 50 MHz: increase CSD modulator clock divider to meet the valid operation conditions
#endif

#if ((CY_CAPSENSE_PERI_CLK / 8 / 8) > 6000000)
    #warning The maximum Sense clock frequency is 6 MHz: increase Sense clock divider for widget Proximity0 to meet the valid operation conditions
#endif

#if ((CY_CAPSENSE_PERI_CLK / 8 / 4) > 6000000)
    #warning The maximum Sense clock frequency is 6 MHz: increase Sense clock divider for widget ProximityW to meet the valid operation conditions
#endif



#if defined(__cplusplus)
}
#endif

#endif /* CY_CAPSENSE_CORE == __CORTEX_M */

#endif /* !defined(CY_DISABLE_CAPSENSE) */

#endif /* (defined(COMPONENT_MW_CAPSENSE) || !defined(COMPONENT_MW_CORE_MAKE)) */

#endif /* CYCFG_CAPSENSE_H */

/* [] END OF FILE */
